# reshape ：在不改变元素值的前提下，改变一个数组的形状（行数和列数）
import numpy as np

# 4 * 3的矩阵
matrix = np.array([
    [1,2,3],
    [4,5,6],
    [7,8,9],
    [10,11,12]
])

# 2 * 6的矩阵
print(matrix.reshape(2,6))
# [[ 1  2  3  4  5  6]
#  [ 7  8  9 10 11 12]]

print("----------------")

# reshape能传入一个有用的参数值-1，表示可以 “根据需要填充元素”
# reshape(1，-1) 意味着矩阵的行数是1，而列数根据需要填充。
print(matrix.reshape(1,-1))
# [[ 1  2  3  4  5  6  7  8  9 10 11 12]]
print("----------------")

# reshape(-1，1) 意味着矩阵的列数是1，而行数根据需要填充。
print(matrix.reshape(-1,1))
print("----------------")

# 如果只提供一个整数作为参数，则会返回一个长度为改值的一位数组
print(matrix.reshape(12))
# [ 1  2  3  4  5  6  7  8  9 10 11 12]
